Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         [(None, 25, 25, 25, 1)]   0
_________________________________________________________________
conv3d (Conv3D)              (None, 25, 25, 25, 32)    896
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 25, 25, 25, 64)    55360
_________________________________________________________________
flatten (Flatten)            (None, 1000000)           0
_________________________________________________________________
dense (Dense)                (None, 16)                16000016
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 17
=================================================================
Total params: 16,056,289
Trainable params: 16,056,289
Non-trainable params: 0
_________________________________________________________________

EPOCHS: 100
Dropout: 0.5
