Model model
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         [(None, 25, 25, 25, 1)]   0
_________________________________________________________________
conv3d (Conv3D)              (None, 25, 25, 25, 32)    896
_________________________________________________________________
batch_normalization (BatchNo (None, 25, 25, 25, 32)    128
_________________________________________________________________
max_pooling3d (MaxPooling3D) (None, 12, 12, 12, 32)    0
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 12, 12, 12, 32)    27680
_________________________________________________________________
batch_normalization_1 (Batch (None, 12, 12, 12, 32)    128
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 6, 6, 6, 32)       0
_________________________________________________________________
flatten (Flatten)            (None, 6912)              0
_________________________________________________________________
dense (Dense)                (None, 256)               1769728
_________________________________________________________________
batch_normalization_2 (Batch (None, 256)               1024
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 257
=================================================================
Total params 1,799,841
Trainable params 1,799,201
Non-trainable params 640
_________________________________________________________________
Epochs Completed.  Time to run  2665.7688691999997

EPOCHS: 100
Dropout: 0.5