Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         [(None, 25, 25, 25, 1)]   0
_________________________________________________________________
conv3d (Conv3D)              (None, 25, 25, 25, 32)    896
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 25, 25, 25, 64)    55360
_________________________________________________________________
flatten (Flatten)            (None, 1000000)           0
_________________________________________________________________
dense (Dense)                (None, 32)                32000032
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 33
=================================================================
Total params: 32,056,321
Trainable params: 32,056,321
Non-trainable params: 0
_________________________________________________________________
Epochs Completed.  Time to run:  6654.3726296

EPOCHS: 100
Dropout: 0.5