Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         [(None, 25, 25, 25, 1)]   0
_________________________________________________________________
conv3d (Conv3D)              (None, 25, 25, 25, 32)    896
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 25, 25, 25, 64)    55360
_________________________________________________________________
flatten (Flatten)            (None, 1000000)           0
_________________________________________________________________
dense (Dense)                (None, 8)                 8000008
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 9
=================================================================
Total params: 8,056,273
Trainable params: 8,056,273
Non-trainable params: 0
_________________________________________________________________
Epochs Completed.  Time to run:  6304.5071245

EPOCHS: 100
Dropout: 0.5